def main(array):
    """
    插入排序

        索引1开始遍历
        2, 6, 5, 4, 3, 1
        ------------------ 索引位与前一位相比 6 > 2 不操作
        2, 6, 5, 4, 3, 1
        遍历到索引2
        ------------------ 5 < 6  
        2, 6, , 4, 3, 1
                5
        ------------------ 将6右移
        2, , 6, 4, 3, 1
                5   
        ------------------ 5 > 2 不移动，将5填入6的位置
        2, 5, 6, 4, 3, 1
        ------------------
        遍历到索引3
        2, 5, 6, , 3, 1
                    4
        ------------------ 4 < 6 将6右移
        2, 5, , 6, 3, 1
                4
        ------------------ 4 < 5 将5右移
        2, , 5, 6, 3, 1
                4
        ------------------ 4 > 2 不移动，将4填入5的位置
        2, 4, 5, 6, 3, 1
        遍历到索引4.......
        2, 3, 4, 5, 6, 1
        ------------------
        遍历到索引5.......
        1, 2, 3, 4, 5, 6
    """
    for i in range(1, len(array)):
        insert_value = array[i]
        # 这样交换次数太多，影响性能
        # for j in range(i, 0, -1):
            # if array[j] < array[j-1]:
            #     array[j], array[j-1] = array[j-1], array[j]
        j = i
        while j > 0 and insert_value < array[j-1]:
            array[j] = array[j-1]
            j -= 1
        array[j] = insert_value

    return array

    
array = [12, 1, 3, 46, 5, 0, -3, 12, 35, 16]
print(main(array))