# 版本1
def main(ary):
    """
    选择排序

    1次遍历，找到索引0-n中最小的，和索引0交换
    2次遍历，找到索引1-n中小的，和索引1交换
    3次遍历，找到索引2-n中小的，和索引2交换

        第0次遍历
        34, 22, 54, 49, 91
        -------------------- [0:] min: 22 索引:1
        0 ！= 1 --> (索引0)34 与 (索引1)22 交换
        22, 34, 54, 49, 91
        --------------------
        第1次遍历
        22, 34, 54, 49, 91
        -------------------- [1:] min: 34 索引:1
        1 == 1 不操作
        --------------------
        第2次遍历
        22, 34, 54, 49, 91 
        -------------------- [2:] min: 49 索引:3
        2 != 3 --> (索引2)54 与 (索引3)49 交换
        22, 34, 49, 54, 91 
        --------------------
        第3次遍历
        22, 34, 49, 54, 91 
        -------------------- [3:] min: 54 索引:3
        3 == 3 不操作 
        --------------------
        第n-1次遍历
        ........
        ....
    """
    for i in range(len(ary)-1):  # 做第i趟排序
        k = i
        j = i + 1
        while j < len(ary):  # 选最小的记录
            if ary[j] < ary[k]:
                k = j  # 记下目前找到的最小值所在的位置
            j += 1
        # 在内层循环结束，也就是找到本轮循环的最小的数以后，再进行交换
        if i != k:
            ary[i], ary[k] = ary[k], ary[i]  # 交换a[i]和a[k]
    return ary

# 版本2
# 这个版本比较容易理解
# 但是空间复杂度相比版本1
# 版本1：O(1)；版本2：O(n)
def main2(ary):
    """
    选择排序

        第0次遍历
        new []
        34, 22, 54, 49, 91
        --------------------- min: 22
        new [22]
        34, 54, 49, 91
        --------------------- min: 34
        new [22, 34]
        54, 49, 91
        --------------------- min: 49
        new [22, 34, 49]
        54, 91
        --------------------- min: 54
        new [22, 34, 49, 54]
        91
        --------------------- min: 91
        new [22, 34, 49, 54, 91]
    """
    def find_min(ary):
        min_num = float('inf')
        min_index = 0
        for i, v in enumerate(ary):
            if v < min_num:
                min_num = v
                min_index = i
        return min_index
    res = []
    while ary:
        min_index = find_min(ary)
        res.append(ary.pop(min_index))

    return res  
    
if "__main__" == __name__:
    ary = [1, 34, 22, 54, 66, 22, 91]
    print(main(ary))  # [1, 22, 22, 34, 54, 66, 91]
    print(main2(ary))  # [1, 22, 22, 34, 54, 66, 91]